title: DLL names used by SVR for GraphicalProton backdoor
description: Hunts for known SVR-specific DLL names.
logsource:
    #service:
    category: image_load
    product: windows
detection:
    selection:
     ImageLoaded|endswith:
      - 'AclNumsInvertHost.dll'
      - 'ModeBitmapNumericAnimate.dll'
      - 'UnregisterAncestorAppendAuto.dll'
      - 'DeregisterSeekUsers.dll'
      - 'ScrollbarHandleGet.dll'
      - 'PerformanceCaptionApi.dll'
      - 'WowIcmpRemoveReg.dll'
      - 'BlendMonitorStringBuild.dll'
      - 'HandleFrequencyAll.dll'
      - 'HardSwapColor.dll'
      - 'LengthInMemoryActivate.dll'
      - 'ParametersNamesPopup.dll'
      - 'ModeFolderSignMove.dll'
      - 'ChildPaletteConnected.dll'
      - 'AddressResourcesSpec.dll'
    condition: selection
    falsepositives: no