title: LOLBAS Chinese APT Credential Dumping as McAffee Logs
id: a0eb8bbd-7616-4933-ae23-cbf2a1f7d2a7
status: experimental
description: Detects the credential dumping, creating a McAffe_Log folder.
references:
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-144a
author: SIMKRA, @SIMKRA202
date: 2023/11/11
tags:
    - attack.credential_access
    - attack.attack.defense_evasion
    - attack.t1003.003 #OS Credential Dumping: NTDS 
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\cmd.exe'
        - OriginalFileName: 'cmd.exe'
    selection_flag:
        CommandLine|contains: '/c wmic process call create'
    selection_key:
        CommandLine|contains:
            - 'cmd.exe /c mkdir C:\windows\Temp\McAfee_Logs'
            - '& ntdsutil \"ac i ntds\" ifm \"create full C:\Windows\Temp\McAfee_Logs\' 
    condition: all of selection_*
falsepositives:
    - not known
level: high