title: Scheduled tasks names used by SVR for GraphicalProton backdoor command
description: Hunts for known SVR-specific scheduled task names command
author: SIMKRA
references: -nm
date: 2023/11/15
logsource:
 category: process_creation
 product: windows
detection:
 selection:
  Image|endswith:
   - 'schtasks.exe'
  CommandLine|contains:
   - 'IISUpdateService'
   - 'WindowsDefenderService'
   - 'WindowsDefenderService2'
   - 'DefenderService'
   - 'DefenderUPDService'
   - 'WiMSDFS'
   - 'StartupAppTaskCkeck'
   - 'SubmitReporting'
   - 'Defender Update Service'
   - 'WindowUpdate'
   - 'CheckReporting'
   - 'StartupAppTaskCheck'
   - 'SpeechModelInstallTask'
   - 'BfeOnServiceStart'
   - 'Data Integrity Update'
   - 'Scheduled AutoCheck'
   - 'ATPUpd'
   - 'Service Update'
   - 'Scheduled Check'
   - 'Scheduled AutoCheck'
   - 'Defender'
   - 'defender'
 selection_re:
  Image|endswith:
   - 'schtasks.exe'
  CommandLine|re:
   - '.*Defender\sUpdate\sService.*'
   - '.*Data\sIntegrity\sUpdate.*'
   - '.*Scheduled\sAutoCheck.*'
   - '.*Service\sUpdate.*'
   - '.*Scheduled\sCheck.*'
   - '.*Scheduled\sAutoCheck.*'
 condition: selection or selection_re